In [5]:
import pandas as pd 
import numpy as np

In [3]:
from numpy.random import randn

In [6]:
np.random.seed(101)

## Init signature: pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
## Docstring:

In [101]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [78]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Data Frame is just a bunch of Pandas Series 
## Here each 'W','X','Y' and 'Z' are individual series which are sharing a commomn INDEX 'A','B','C','D','E'

## Two Ways to grab column from Pandas DataFrame

 First method :->

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

Second Method :->
## Avoid using This method to grab the data frame column

In [10]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df['W'].dtype

dtype('float64')

In [14]:
type(df.W)

pandas.core.series.Series

## Grabing Multiple column from DataFrame
## to do this pass the list of column name which column required

In [16]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

## Creating New column in DataFrame

In [17]:
df['New']=df['W']+df['Y']

In [18]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

## Droping Column from DataFrame

In [19]:
df.drop('New',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Specify axis also otherwise will get error :-> axis=0 for ROW and AXIS=1 For column
## ''.drop()'  Method doesn't remove column from main dataFrame 
## to remove column from main DataFrame use 'inplace' parameter as 'True'
## we can see 'New' colum n is present in main Datarame below

In [20]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

## dropping column from main dataFrame using inplace=True

In [22]:
df.drop('New',axis=1,inplace=True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Droping Rows from DataFrame usong '.drop()' method

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.drop('E') # No need to give axis=0 bcz it's default

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.shape

(5, 4)

## since dataFrame shape is a tuple of no of rows 5 and no of column 4
## and in tuple (5,4) index of 5 is '0' and index of 4 is 1
## so in datarame rows is considered as axis=0 and column is considered as axis=1

## Two Methoods to grab rows from DataFrame
## Grabing rows from DataFrame using loc (location)
## and using iloc(index location)

First Method using .loc ('Location' )

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

## Here we can see row is also a series as column was series

In [33]:
type(df.loc['C'])

pandas.core.series.Series

Second Method of grabing rows using .iloc(index location) :->

In [34]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

## Grabing any particular row and column values OR some part of DataFrame as 
 Here also we use the same method as numpy Array 
 where we used single [] and giving rows and columns separated by comma ',' ->>>

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selecting a single row and column values

In [37]:
df.loc['A','X']

0.6281327087844596

Selecting a part of dataFrame like some part of rows and column values

In [38]:
df.loc[['A','D'],['W','Z']]

          W         Z
A  2.706850  0.503826
D  0.188695  0.955057

## Conditional Selection from DataFrame

In [102]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [40]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [55]:
bool_df=df>0

In [56]:
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [57]:
type(bool_df)

pandas.core.frame.DataFrame

## Important 
if we put 'df>0' in our main dataFrame we get NAN for false redcords

In [43]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Important 

since df['W'] is a series 
when we pass this series in our main dataFrame it will give 
the records where the given condition df['W']>0 is true
It will remove those record where given condition is False


Check Below :-->>>>

In [47]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [48]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df['Y']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [50]:
resultdf=df[df['W']>0]

In [51]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selecting multiple columns with filters on different columns
Check Below :--->>>>>

In [103]:
df[df['W']>0][['X','Y']]

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

In [104]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Passing Multiple filter Conditions

In [63]:
df[(df['Y']>0) & (df['X']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df[(df['Y']<1) & (df['X']>0) & (df['Z']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

## Resetting Index:---->>>>>

In [72]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

## Note :->>> 'reset_index' method doesnt occur 'inplace'
To make it occur 'inplace ' in df we need to put inplace=True

In [74]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Here no change occur in main df  after using reset_index method

 reset_index with inplace=True
    Check Below :->>>>>

df.reset_index(inplace=True)

In [85]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## Other method to set Index :
## Check Below-->>>

Quick way ro create a random list :->>>

In [86]:
newind='CA NY WO OR CK'.split

In [87]:
newind

In [88]:
newind()

['CA', 'NY', 'WO', 'OR', 'CK']

In [92]:
df['States']=newind()

In [93]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WO
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CK

## Set_index Method :
'States' column has been added in our df Now we can make this column as Index 
Using 'set_index' method
check Below : ---->>>>

In [96]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WO      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CK     -0.925874  1.862864 -1.133817  0.610478